# Все константы и вспомогательные функции

import numpy as np

class Reaction:
    def __init__(self, G, k):
        self.G = G
        self.k = k

# константы для расчетов
R = 8.314 * 10**(-3)
k_B_const = 1.38 * 10**(-26)
h = 6.63 * 10**(-37)

# перечисление веществ (порядок важен)
substances = ['C_B', 'C_E', 'C_EB', 'C_P', 'C_PB', 'C_MB', 'C_MEB', 'C_DFE', 'C_DEB', 'C_H']

# молярные массы
M_B = 78.11
M_E = 28.05
M_EB = 106.17
M_P = 42.08
M_PB = 120.19
M_MB = 92.13
M_MEB = 120.19
M_DFE = 182.26
M_DEB = 134.22
M_H = 2.01

molar_masses = np.array([M_B, M_E, M_EB, M_P, M_PB, M_MB, M_MEB, M_DFE, M_DEB, M_H])
#мольные теплоемкости
def cp_B(T):
    return -31.662 + 1.3043*T - 3.61e-03*T**2 + 3.82e-06*T**3

def cp_E(T):
    return 32.083 - 0.01483*T + 2.48e-04*T**2 - 2.38e-07*T**3

def cp_EB(T):
    return 102.111 + 0.5596*T - 1.56e-03*T**2 + 2.01e-06*T**3

def cp_P(T):
    return -31.662 + 1.3043*T - 3.61e-03*T**2 + 3.82e-06*T**3

def cp_PB(T):
    return 124.621 + 0.6329*T - 1.73e-03*T**2 + 2.21e-06*T**3

def cp_MB(T):
    return 83.703 + 0.5167*T - 1.49e-03*T**2 + 1.97e-06*T**3

def cp_MEB(T):
    return 142.0171 + 0.44873*T - 0.00114141*T**2 + 1.6e-06*T**3

def cp_DFE(T):
    return 164.4244 + 0.9648*T - 0.002010922*T**2 + 1.94e-06*T**3

def cp_DEB(T):
    return 162.8256 + 0.56588*T - 1.39e-03*T**2 + 1.83e-06*T**3

def cp_H(T):
    return 25.399 + 2.02e-01*T - 3.85e-05*T**2 + 3.19e-08*T**3


# Cp(T) = a + b*T + c*T^2 + d*T^3

cp_coeffs = {
    'C_B':   (-31.662,   1.3043,     -3.6078e-03,  3.8243e-06),
    'C_E':   (32.083,   -0.01483,     2.4774e-04, -2.3770e-07),
    'C_EB':  (102.111,   0.5596,     -1.5609e-03,  2.0149e-06),
    'C_P':   (54.718,    0.3451,     -1.6315e-03,  3.8755e-06),
    'C_PB':  (124.621,   0.6329,     -1.7331e-03,  2.2146e-06),
    'C_MB':  (83.703,    0.5167,     -1.4910e-03,  1.9725e-06),
    'C_MEB': (142.01705, 0.448734,   -0.001141405, 1.5981e-06),
    'C_DFE': (164.4244,  0.964798,   -0.00201092,  1.93988e-06),
    'C_DEB': (162.8256,  0.565878,   -1.3920e-03,  1.8253e-06),
    'C_H':   (25.399,    2.0178e-02, -3.8549e-05,  3.1880e-08),
}

# базовая температура для интегрирования Cp(T)
T_ref_cp = 298.0

def int_cp_from_poly(coeffs, T2, T1=T_ref_cp):

    a, b, c, d = coeffs
    return (a * (T2 - T1)
            + 0.5 * b * (T2**2 - T1**2)
            + (1.0 / 3.0) * c * (T2**3 - T1**3)
            + 0.25 * d * (T2**4 - T1**4))

# Энтальпии реакций при 298 K


H298r = np.array([
    9.866,   # Б+Э <-> ЭБ
    3.351,   # Б+П <-> ПБ
    9.18,    # МБ+Э <-> МЭБ
    3.003,   # Б+ЭБ <-> ДФЭ+В
    7.33     # ЭБ+Э <-> ДЭБ
])
